tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Console Matrix
brew "cmatrix"
# Modern replacement for 'ls'
brew "exa"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
